{
    "Task 1": {
        "Task Description": "The user is planning an upcoming weekend getaway and needs assistance finding suitable activities, restaurants, and accommodations that cater to their preferences. The assistant should recommend local attractions, events, restaurants with the user's preferred cuisine and ambiance, and hotels aligned with their desired amenities, location, and room type preferences.",
        "User Intent": "Plan a weekend getaway by finding activities, restaurants, and accommodations that match your interests and preferences for attractions, cuisine, ambiance, hotel amenities, location, and room types.",
        "Task Goal": "The user receives a comprehensive itinerary for their weekend getaway, including recommended activities, restaurant reservations, and hotel bookings that align with their preferences.",
        "Relevant Domains": [
            "Events",
            "Restaurants",
            "Hotels",
            "Travel"
        ],
        "Relevant Affinity Types": [
            "Event Type Preference",
            "Cuisine Preference",
            "Ambiance Preference",
            "Amenity Preference",
            "Location Preference",
            "Room Type Preference",
            "Preferred Destination Types"
        ],
        "task_id": "MD-task-1",
        "situations": {
            "Location": "Helsinki, Finland",
            "Device": "Laptop",
            "Time of Day": "Evening",
            "Day of the Week": "Friday",
            "Environment": "Quiet"
        }
    },
    "Task 2": {
        "Task Description": "The user is interested in exploring new music and attending concerts or music festivals. They need assistance discovering new artists, songs, and albums based on their preferred genres and favorite bands. Additionally, the assistant should provide recommendations for upcoming music events and concerts that align with the user's music preferences and location.",
        "User Intent": "Discover new music and artists based on your favorite genres and bands, and find upcoming concerts or music festivals that match your interests and location.",
        "Task Goal": "The user discovers new music and artists that align with their preferences, and receives a list of recommended music events or concerts to attend based on their location and music interests.",
        "Relevant Domains": [
            "Music",
            "Events"
        ],
        "Relevant Affinity Types": [
            "Preferred Genres",
            "Favorite Bands",
            "Preferred Audio Quality",
            "Event Type Preference",
            "Location Preference"
        ],
        "task_id": "MD-task-3",
        "situations": {
            "Location": "Helsinki, Finland",
            "Device": "Laptop",
            "Time of Day": "Evening",
            "Day of the Week": "Saturday",
            "Environment": "Quiet"
        }
    },
    "Task 3": {
        "Task Description": "The user wants to organize a movie night at home, including ordering dinner delivery and setting up calendar reminders for friends, while considering everyone's media and food preferences.",
        "User Intent": "Plan a movie night with friends, including dinner delivery and scheduling, based on group preferences.",
        "Task Goal": "The user selects appropriate movies, arranges food delivery, and sets up calendar invites that accommodate everyone's preferences.",
        "Relevant Domains": [
            "Media",
            "Restaurants",
            "Calendar",
            "Messaging"
        ],
        "Relevant Affinity Types": [
            "Preferred Genres (Media)",
            "Viewing Platform Preference",
            "Cuisine Preference",
            "Event Type Preference",
            "Preferred Communication Style"
        ],
        "task_id": "MD-task-4",
        "situations": {
            "Location": "Helsinki, Finland",
            "Device": "Laptop",
            "Time of Day": "Evening",
            "Day of the Week": "Saturday",
            "Environment": "Quiet"
        }
    },
    "Task 4": {
        "Task Description": "The user needs to book a service appointment, such as a haircut, dental cleaning, or doctor visit, and wants to find a provider that meets their preferences for location, service type, appointment time, and service provider gender.",
        "User Intent": "Book an appointment for a service like a haircut, dental cleaning, or doctor visit, considering your preferences for location, service type, appointment time, and the service provider's gender.",
        "Task Goal": "The user successfully books a service appointment with a provider that aligns with their preferences for location, service type, appointment time, and service provider gender.",
        "Relevant Domains": [
            "Services",
            "Calendar"
        ],
        "Relevant Affinity Types": [
            "Preferred Service Provider Types",
            "Appointment Time Preference",
            "Location Preference",
            "Service Provider Gender Preference",
            "Event Type Preference",
            "Notification Preference"
        ],
        "task_id": "MD-task-5",
        "situations": {
            "Location": "Helsinki, Finland",
            "Device": "Laptop",
            "Time of Day": "Evening",
            "Day of the Week": "Tuesday",
            "Environment": "Quiet"
        }
    },
    "Task 5": {
        "Task Description": "The user is looking to manage their finances and investments more effectively. The assistant should provide updates on stock prices and news related to the user's preferred financial sectors and companies. Additionally, the assistant can assist in setting up financial goals, tracking investments, and receiving notifications for important financial events or news.",
        "User Intent": "Manage your finances and investments by receiving updates on stock prices and news related to your preferred financial sectors and companies, setting financial goals, and tracking investments.",
        "Task Goal": "The user receives personalized updates on their preferred financial sectors and companies, has a way to track their investments and financial goals, and is notified about important financial events or news.",
        "Relevant Domains": [
            "Finance",
            "Calendar",
            "Messaging"
        ],
        "Relevant Affinity Types": [
            "Preferred Sectors",
            "News Sources",
            "Financial Company",
            "Notification Preference",
            "Preferred Messaging Apps"
        ],
        "task_id": "MD-task-7",
        "situations": {
            "Location": "Helsinki, Finland",
            "Device": "Laptop",
            "Time of Day": "Evening",
            "Day of the Week": "Saturday",
            "Environment": "Quiet"
        }
    },
    "Task 6": {
        "Task Description": "The user wants to create a personalized evening routine that includes setting alarms, scheduling media content, and organizing reading material for the next day.",
        "User Intent": "Set up your evening routine with alarms, media content, and reading material for tomorrow.",
        "Task Goal": "The user establishes a coordinated evening schedule with appropriate alarms, media content queued, and reading material selected.",
        "Relevant Domains": [
            "Alarm",
            "Media",
            "Books",
            "Calendar"
        ],
        "Relevant Affinity Types": [
            "Alarm Time Preference",
            "Preferred Genres",
            "Reading Time Preference",
            "Genre",
            "Reading Format",
            "Notification Preference"
        ],
        "task_id": "MD-task-11",
        "situations": {
            "Location": "Helsinki, Finland",
            "Device": "Tablet",
            "Time of Day": "Evening",
            "Day of the Week": "Friday",
            "Environment": "Quiet"
        }
    },
    "Task 7": {
        "Task Description": "The user needs to organize a business trip involving train travel, hotel booking, and scheduling multiple calendar appointments with various stakeholders.",
        "User Intent": "Plan your business trip by booking train tickets, hotel accommodations, and scheduling meetings with stakeholders.",
        "Task Goal": "The user successfully coordinates train travel, hotel stay, and meeting schedule that aligns with all participants' availability.",
        "Relevant Domains": [
            "Train",
            "Hotels",
            "Calendar",
            "Messaging"
        ],
        "Relevant Affinity Types": [
            "Preferred Train Class",
            "Hotel Chains Preference",
            "Room Type Preference",
            "Event Type Preference",
            "Preferred Communication Style"
        ],
        "task_id": "MD-task-14",
        "situations": {
            "Location": "Helsinki, Finland",
            "Device": "Laptop",
            "Time of Day": "Evening",
            "Day of the Week": "Tuesday",
            "Environment": "Quiet"
        }
    },
    "Task 8": {
        "Task Description": "The user wants to create a shopping itinerary that includes visiting multiple stores, dining options, and entertainment venues within a shopping complex.",
        "User Intent": "Plan your shopping day with store visits, dining options, and entertainment activities at the mall.",
        "Task Goal": "The user creates a structured shopping schedule with appropriate timing for store visits, meals, and entertainment activities.",
        "Relevant Domains": [
            "Shopping",
            "Restaurants",
            "Events",
            "Calendar"
        ],
        "Relevant Affinity Types": [
            "Preferred Product Category",
            "Brand Preference",
            "Cuisine Preference",
            "Price Range",
            "Event Type Preference"
        ],
        "task_id": "MD-task-15",
        "situations": {
            "Location": "Helsinki, Finland",
            "Device": "Laptop",
            "Time of Day": "Evening",
            "Day of the Week": "Saturday",
            "Environment": "Quiet"
        }
    },
    "Task 9": {
        "Task Description": "The user seeks to plan a music-themed evening including purchasing concert tickets, arranging dinner at a venue with live music, and creating a playlist for the car ride.",
        "User Intent": "Organize a music-themed evening with concert tickets, dinner at a live music venue, and a travel playlist.",
        "Task Goal": "The user successfully books concert tickets, reserves dinner at an appropriate venue, and creates a coordinated playlist for transportation.",
        "Relevant Domains": [
            "Music",
            "Events",
            "Restaurants",
            "Calendar"
        ],
        "Relevant Affinity Types": [
            "Preferred Genres",
            "Favorite Artists",
            "Event Type Preference",
            "Cuisine Preference",
            "Platform Preference"
        ],
        "task_id": "MD-task-16",
        "situations": {
            "Location": "Helsinki, Finland",
            "Device": "Laptop",
            "Time of Day": "Evening",
            "Day of the Week": "Friday",
            "Environment": "Quiet"
        }
    },
    "Task 10": {
        "Task Description": "The user wants to monitor their investment portfolio while coordinating related calendar events for earnings calls and setting up alerts for specific market conditions.",
        "User Intent": "Set up a system to track your investments, schedule earnings calls, and receive market alerts.",
        "Task Goal": "The user successfully establishes a coordinated system for investment tracking, scheduled events, and customized alerts.",
        "Relevant Domains": [
            "Finance",
            "Calendar",
            "Alarm",
            "Messaging"
        ],
        "Relevant Affinity Types": [
            "Preferred Sectors",
            "Financial Company",
            "Event Type Preference",
            "Alarm Time Preference",
            "Notification Preference"
        ],
        "task_id": "MD-task-17",
        "situations": {
            "Location": "Helsinki, Finland",
            "Device": "Laptop",
            "Time of Day": "Morning",
            "Day of the Week": "Monday",
            "Environment": "Quiet"
        }
    },
    "Task 11": {
        "Task Description": "The user needs to plan a family movie night including selecting age-appropriate content, ordering dinner delivery, and coordinating viewing schedules across multiple household members.",
        "User Intent": "Arrange a family movie night with appropriate content selection, dinner delivery, and coordinated viewing schedules.",
        "Task Goal": "The user successfully selects suitable content, arranges meal delivery, and coordinates viewing time that accommodates all family members.",
        "Relevant Domains": [
            "Media",
            "Movies",
            "Restaurants",
            "Calendar"
        ],
        "Relevant Affinity Types": [
            "Preferred Genres",
            "Theater Type Preference",
            "Cuisine Preference",
            "Viewing Time Preference",
            "Price Range"
        ],
        "task_id": "MD-task-18",
        "situations": {
            "Location": "Helsinki, Finland",
            "Device": "Smart TV",
            "Time of Day": "Evening",
            "Day of the Week": "Saturday",
            "Environment": "Quiet"
        }
    },
    "Task 12": {
        "Task Description": "The user wants to create a perfect workout environment by scheduling exercise sessions, setting up alarms, and creating a motivational music playlist for their fitness routine.",
        "User Intent": "Set up your daily workout schedule with appropriate alarms and a customized music playlist.",
        "Task Goal": "The user establishes a workout schedule with synchronized alarms and a personalized workout playlist.",
        "Relevant Domains": [
            "Calendar",
            "Alarm",
            "Music"
        ],
        "Relevant Affinity Types": [
            "Event Type Preference",
            "Alarm Time Preference",
            "Preferred Genres",
            "Playlist Preference",
            "Alarm Recurring Preference"
        ],
        "task_id": "MD-task-19",
        "situations": {
            "Location": "Helsinki, Finland",
            "Device": "Smartphone",
            "Time of Day": "Morning",
            "Day of the Week": "Saturday",
            "Environment": "Quiet"
        }
    },
    "Task 13": {
        "Task Description": "The user is planning a book club meeting and needs help selecting books, scheduling the meeting, and finding a suitable restaurant venue. The assistant should consider their literary preferences and dining requirements.",
        "User Intent": "Organize a book club meeting by selecting books, scheduling the event, and finding a restaurant venue.",
        "Task Goal": "The user successfully chooses books, schedules the meeting, and reserves a restaurant that accommodates the group's needs.",
        "Relevant Domains": [
            "Books",
            "Calendar",
            "Restaurants"
        ],
        "Relevant Affinity Types": [
            "Genre",
            "Reading Format",
            "Event Type Preference",
            "Cuisine Preference",
            "Ambiance Preference",
            "Group Size Preference"
        ],
        "task_id": "MD-task-21",
        "situations": {
            "Location": "Helsinki, Finland",
            "Device": "Laptop",
            "Time of Day": "Evening",
            "Day of the Week": "Saturday",
            "Environment": "Quiet"
        }
    },
    "Task 14": {
        "Task Description": "The user wants to plan a reading schedule for their book club, including setting calendar reminders for meetings, coordinating through group messages, and finding new books to read. The assistant should consider reading preferences, scheduling needs, and communication requirements.",
        "User Intent": "Organize your book club schedule, coordinate with members, and select books for upcoming meetings.",
        "Task Goal": "The user establishes a reading schedule, sets up communication channels, and selects appropriate books for the club.",
        "Relevant Domains": [
            "Books",
            "Calendar",
            "Messaging"
        ],
        "Relevant Affinity Types": [
            "Genre",
            "Reading Format",
            "Event Type Preference",
            "Preferred Messaging Apps",
            "Communication Style"
        ],
        "task_id": "MD-task-24",
        "situations": {
            "Location": "Helsinki, Finland",
            "Device": "Laptop",
            "Time of Day": "Evening",
            "Day of the Week": "Saturday",
            "Environment": "Quiet"
        }
    },
    "Task 15": {
        "Task Description": "The user needs to plan a romantic date night, including finding a movie or event, booking a restaurant, and creating a custom music playlist for the evening. The assistant should consider entertainment preferences, dining preferences, and music tastes.",
        "User Intent": "Plan a romantic evening with entertainment, dinner, and a custom music playlist.",
        "Task Goal": "The user successfully arranges all components of the date night according to preferences.",
        "Relevant Domains": [
            "Movies",
            "Restaurants",
            "Music",
            "Events"
        ],
        "Relevant Affinity Types": [
            "Preferred Genres",
            "Cuisine Preference",
            "Preferred Genres (Music)",
            "Ambiance Preference",
            "Event Type Preference"
        ],
        "task_id": "MD-task-25",
        "situations": {
            "Location": "Helsinki, Finland",
            "Device": "Laptop",
            "Time of Day": "Evening",
            "Day of the Week": "Saturday",
            "Environment": "Quiet"
        }
    }
}